OpenFOAM/problems/backFacingStep/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    ( 2.0 -1.0 0.0)
    (10.0 -1.0 0.0)
    ( 2.0 -0.5 0.0)
    (10.0 -0.5 0.0)
    ( 0.0  0.0 0.0)
    ( 2.0  0.0 0.0)
    (10.0  0.0 0.0)
    ( 0.0  0.5 0.0)
    ( 2.0  0.5 0.0)
    (10.0  0.5 0.0)
    ( 0.0  1.0 0.0)
    ( 2.0  1.0 0.0)
    (10.0  1.0 0.0)
    
    ( 2.0 -1.0 1.0)
    (10.0 -1.0 1.0)
    ( 2.0 -0.5 1.0)
    (10.0 -0.5 1.0)
    ( 0.0  0.0 1.0)
    ( 2.0  0.0 1.0)
    (10.0  0.0 1.0)
    ( 0.0  0.5 1.0)
    ( 2.0  0.5 1.0)
    (10.0  0.5 1.0)
    ( 0.0  1.0 1.0)
    ( 2.0  1.0 1.0)
    (10.0  1.0 1.0)
);

blocks
(
    hex ( 0  1  3  2 13 14 16 15) (128 32 1) simpleGrading (1 2.0 1)
    hex ( 2  3  6  5 15 16 19 18) (128 32 1) simpleGrading (1 0.5 1)
    hex ( 4  5  8  7 17 18 21 20) (32 32 1) simpleGrading (1 2.0 1)
    hex ( 5  6  9  8 18 19 22 21) (128 32 1) simpleGrading (1 2.0 1)
    hex ( 7  8 11 10 20 21 24 23) (32 32 1) simpleGrading (1 0.5 1)
    hex ( 8  9 12 11 21 22 25 24) (128 32 1) simpleGrading (1 0.5 1)
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (4 17 20  7)
            (7 20 23 10)
        );
    }
    
    inControl
    {
        type patch;
        faces
        (
            (2 5 18 15)
        );
    }

    outlet
    {
        type patch;
        faces
        (
            ( 1  3 16 14)
            ( 3  6 19 16)
            ( 6  9 22 19)
            ( 9 12 25 22)
        );
    }

    otherWalls
    {
        type patch;
        faces
        (
            (11 10 23 24)
            (12 11 24 25)
            ( 4  5 18 17)
            ( 2  0 13 15)
        );
    }

    lowerWall
    {
        type patch;
        faces
        (
            ( 0  1 14 13)
        );
    }


    frontAndBack
    {
        type empty;
        faces
        (
            (0 2 3 1)
            (2 5 6 3)
            (5 8 9 6)
            (8 11 12 9)
            (4 7 8 5)
            (7 10 11 8)
            (13 14 16 15)
            (15 16 19 18)
            (18 19 22 21)
            (21 22 25 24)
            (17 18 21 20)
            (20 21 24 23)
        );
    }
);

// ************************************************************************* //
