OpenFOAM/problems/backFacingStep/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.1                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    inlet
    {
        type            patch;
        nFaces          64;
        startFace       36576;
    }
    inControl
    {
        type            patch;
        nFaces          32;
        startFace       36640;
    }
    outlet
    {
        type            patch;
        nFaces          128;
        startFace       36672;
    }
    otherWalls
    {
        type            patch;
        nFaces          224;
        startFace       36800;
    }
    lowerWall
    {
        type            patch;
        nFaces          128;
        startFace       37024;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          36864;
        startFace       37152;
    }
)

// ************************************************************************* //
