OpenFOAM/problems/backFacingStep/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1906                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];


internalField   nonuniform List<vector> 
18432
(
(2.01085988037e-05 -2.25071363825e-06 0)
(3.0940579272e-05 3.74484778188e-07 0)
(-1.51154734029e-05 1.64567048585e-06 0)
(-0.000101192023537 2.7013875561e-06 0)
(-0.000214752730374 3.16746608385e-06 0)
(-0.000341072247348 3.41169836387e-06 0)
(-0.000473235699123 3.46389690564e-06 0)
(-0.000606653555692 3.46652242212e-06 0)
...
)
;

boundaryField
{
    inlet
    {
        type            fixedProfile;
        profile         csvFile;
        profileCoeffs
        {
            nHeaderLine     0;
            refColumn       0;
            componentColumns 3(1 2 3);
            separator       ",";
            mergeSeparators 0;
            file            "$FOAM_CASE/Uprofile.csv";
        }
        direction       (0 1 0);
        origin          0;
        value           nonuniform List<vector> 
64
(
(0.0322727389161 0 0)
(0.0964780582597 0 0)
(0.160649956483 0 0)
(0.224721458542 0 0)
(0.288615277167 0 0)
(0.352256778203 0 0)
(0.415562234056 0 0)
(0.478440647106 0 0)
...
)
;
    }
    inControl
    {
        type            uniformFixedValue;
        uniformValue    tableFile;
        uniformValueCoeffs
        {
            file            "$FOAM_CASE/control0";
        }
    }
    outlet
    {
        type            zeroGradient;
    }
    otherWalls
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    lowerWall
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
