OpenFOAM/problems/backFacingStep/0/dU
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1906                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volTensorField;
    location    "0";
    object      dU;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];


internalField   nonuniform List<tensor> 
18432
(
(0.000408393424606 -1.50098308805e-05 0 0.00305233183362 -0.000541872936714 0 0 0 0)
(-0.000281792577653 3.11710729928e-05 0 0.00420968763327 0.00034420212676 0 0 0 0)
(-0.00105706082247 1.86152222233e-05 0 -0.00443841863861 0.00117362755489 0 0 0 0)
(-0.00159709805577 1.2174364784e-05 0 -0.0201766100176 0.00179790954526 0 0 0 0)
(-0.00191904179049 5.6824864622e-06 0 -0.0408220582458 0.00214228613602 0 0 0 0)
(-0.00206786374999 2.3714465743e-06 0 -0.0638359833538 0.00231307109833 0 0 0 0)
(-0.00212465046675 4.38592466017e-07 0 -0.0879612739371 0.00237275038348 0 0 0 0)
(-0.00213358953731 -1.52799189283e-07 0 -0.11236699115 0.00238402856789 0 0 0 0)
...
)
;

boundaryField
{
    inlet
    {
        type            extrapolatedCalculated;
        value           nonuniform List<tensor> 
64
(
(-0.00893871258452 -0.000277717527541 0 5.86717769123 -0.00346379098852 0 0 0 0)
(-0.0267045208284 -0.00214095602446 0 5.76401584149 -0.00428004805787 0 0 0 0)
(-0.0365112075049 -0.00329974367831 0 5.64893543618 -0.0022943528629 0 0 0 0)
(-0.0410942085267 -0.00379445979089 0 5.52362342849 -0.000853544662508 0 0 0 0)
(-0.042351608171 -0.00392757068084 0 5.39016111423 -0.000111099079788 0 0 0 0)
(-0.0417929407291 -0.00387650591563 0 5.25022676222 0.000253277326002 0 0 0 0)
(-0.0403263502858 -0.0037304351467 0 5.10499831043 0.00041067600823 0 0 0 0)
(-0.0384543293566 -0.00355102160522 0 4.95528178671 0.000428231579198 0 0 0 0)
...
)
;
    }
    inControl
    {
        type            extrapolatedCalculated;
        value           nonuniform List<tensor> 
32
(
(-0.0138241344326 0.27714159761 0 -0.00175876812807 0.0401362221925 0 0 0 0)
(-0.0151040648801 0.3053695747 0 -0.00202226761745 0.042378616656 0 0 0 0)
(-0.0165601259767 0.334508088188 0 -0.00237826451147 0.0447338599722 0 0 0 0)
(-0.0182501980061 0.364585337732 0 -0.00284415785897 0.0472359240124 0 0 0 0)
(-0.0202391005204 0.395653101451 0 -0.00343918453964 0.0499302838127 0 0 0 0)
(-0.0226002736934 0.427788478033 0 -0.00418647755246 0.0528663038637 0 0 0 0)
(-0.0254171674553 0.461092341088 0 -0.00511265861269 0.0560941895555 0 0 0 0)
(-0.0287840042905 0.495687093434 0 -0.00624743260527 0.059663836143 0 0 0 0)
...
)
;
    }
    outlet
    {
        type            extrapolatedCalculated;
        value           nonuniform List<tensor> 
128
(
(0 0 0 4.18607305818 -0.0328946346144 0 0 0 0)
(0 0 0 3.95830960318 -0.0576590816106 0 0 0 0)
(0 0 0 3.74304472456 -0.0794957753505 0 0 0 0)
(0 0 0 3.53942622514 -0.0964265579309 0 0 0 0)
(0 0 0 3.34638916805 -0.110408196275 0 0 0 0)
(0 0 0 3.16317329701 -0.12289968919 0 0 0 0)
(0 0 0 2.98949112647 -0.134428951446 0 0 0 0)
(0 0 0 2.82547172647 -0.14517398478 0 0 0 0)
...
)
;
    }
    otherWalls
    {
        type            extrapolatedCalculated;
        value           nonuniform List<tensor> 
224
(
(0.000730799410992 -6.71519000442e-05 0 -5.91564278332 -0.00159606818295 0 0 0 0)
(0.00324882627183 -4.77378336769e-05 0 -6.03581255747 0.00314813022373 0 0 0 0)
(-0.00173692580126 0.000125307823952 0 -5.9907319458 -0.000492717726592 0 0 0 0)
(-1.44105092914e-05 -2.58744521442e-05 0 -5.99566750421 0.000251927482771 0 0 0 0)
(-0.000408802236711 4.81048971161e-06 0 -5.99039887996 0.000105310847025 0 0 0 0)
(-0.000396420593868 -2.71367125438e-06 0 -5.9862189788 0.000140744054245 0 0 0 0)
(-0.000463915477752 -1.76787916634e-06 0 -5.9812365278 0.000168031129583 0 0 0 0)
(-0.000522577791733 -1.49511876467e-06 0 -5.97549663732 0.000181604523494 0 0 0 0)
...
)
;
    }
    lowerWall
    {
        type            extrapolatedCalculated;
        value           nonuniform List<tensor> 
128
(
(0.000408393424606 -1.50098308805e-05 0 0.00371811286067 -0.000416160638826 0 0 0 0)
(-0.000281792577653 3.11710729928e-05 0 0.00572096379418 6.9242848967e-05 0 0 0 0)
(-0.00105706082247 1.86152222233e-05 0 -0.00279487579433 0.000304287168768 0 0 0 0)
(-0.00159709805577 1.2174364784e-05 0 -0.0187105709246 0.000499490984529 0 0 0 0)
(-0.00191904179049 5.6824864622e-06 0 -0.0397081316537 0.000585669667839 0 0 0 0)
(-0.00206786374999 2.3714465743e-06 0 -0.0630648172785 0.000630828616516 0 0 0 0)
(-0.00212465046675 4.38592466017e-07 0 -0.0875020560215 0.0006404802124 0 0 0 0)
(-0.00213358953731 -1.52799189283e-07 0 -0.112171236266 0.0006409656747 0 0 0 0)
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
