OpenFOAM/problems/backFacingStep/0/phi
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1906                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       surfaceScalarField;
    location    "0";
    object      phi;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 3 -1 0 0 0 0];
oriented        oriented;


internalField   nonuniform List<scalar> 
36576
(
2.99611413114e-07
-2.99611694184e-07
8.93521079243e-08
2.10258861257e-07
-6.21356099945e-07
7.1070745017e-07
-1.70964094326e-06
1.08828447305e-06
...
)
;

boundaryField
{
    inlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
64
(
-0.000349080075545
-0.00106715729097
-0.00181715150862
-0.00259935572159
-0.00341390264826
-0.00426090469647
-0.00514030843915
-0.0060519010829
...
)
;
    }
    inControl
    {
        type            calculated;
        value           uniform 0;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
128
(
0.000257546216963
0.000758628935284
0.0012628217693
0.00177311872605
0.00228964136253
0.00281247294525
0.00334170469761
0.00387749409392
...
)
;
    }
    otherWalls
    {
        type            calculated;
        value           uniform 0;
    }
    lowerWall
    {
        type            calculated;
        value           uniform 0;
    }
    frontAndBack
    {
        type            empty;
        value           nonuniform 0();
    }
}


// ************************************************************************* //
